-------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /Users/lesliehuang/un-analysis-reg/un_log.log
  log type:  text
 opened on:  27 Nov 2017, 20:36:57

. 
. set seed 1234

. 
. * import data
. import delimited data_by_country_year_topic_all
(12 vars, 168948 obs)

. 
. encode country, gen(country1)

. encode topic, gen(topic1)

. 
. gen log_gdp = log(gdp)
(5,206 missing values generated)

. 
. egen country_topic = group(country1 topic1)

. 
. xtset country_topic year
       panel variable:  country_topic (unbalanced)
        time variable:  year, 1993 to 2016, but with gaps
                delta:  1 unit

. 
. xtsum

Variable         |      Mean   Std. Dev.       Min        Max |    Observations
-----------------+--------------------------------------------+----------------
country  overall |         .          .          .          . |     N =       0
         between |                    .          .          . |     n =       0
         within  |                    .          .          . |     T =       .
                 |                                            |
gdp      overall |  2.70e+11   1.17e+12   1.32e+07   1.86e+13 |     N =  163742
         between |             1.06e+12   2.73e+07   1.25e+13 |     n =    7296
         within  |             4.11e+11  -5.39e+12   7.46e+12 | T-bar = 22.4427
                 |                                            |
perm_m~r overall |  .0269906   .1620562          0          1 |     N =  168948
         between |             .1588679          0          1 |     n =    7334
         within  |                    0   .0269906   .0269906 | T-bar = 23.0363
                 |                                            |
propor~a overall |  .0309375   .0611574          0   .4032698 |     N =  168948
         between |             .0606148          0   .3631926 |     n =    7334
         within  |             .0080713  -.0267948   .0842538 | T-bar = 23.0363
                 |                                            |
record~e overall |         .          .          .          . |     N =       0
         between |                    .          .          . |     n =       0
         within  |                    .          .          . |     T =       .
                 |                                            |
sc_mem~p overall |         .          .          .          . |     N =       0
         between |                    .          .          . |     n =       0
         within  |                    .          .          . |     T =       .
                 |                                            |
sessio~m overall |  59.66329   6.889661         48         71 |     N =  168948
         between |             1.187379   55.78571       68.5 |     n =    7334
         within  |             6.833124   47.09186   72.74022 | T-bar = 23.0363
                 |                                            |
speaker  overall |         .          .          .          . |     N =       0
         between |                    .          .          . |     n =       0
         within  |                    .          .          . |     T =       .
                 |                                            |
speech~n overall |  .0258521   .0617097   .0001692   .7325845 |     N =  160056
         between |             .0571177   .0011271   .6086785 |     n =    6948
         within  |             .0236615  -.2584085   .4035768 | T-bar = 23.0363
                 |                                            |
temp_m~r overall |  .0537562   .2255366          0          1 |     N =  168948
         between |             .0713336          0   .3333333 |     n =    7334
         within  |             .2137665  -.2795771    1.01209 | T-bar = 23.0363
                 |                                            |
topic    overall |         .          .          .          . |     N =       0
         between |                    .          .          . |     n =       0
         within  |                    .          .          . |     T =       .
                 |                                            |
year     overall |  2004.667   6.887028       1993       2016 |     N =  168948
         between |             1.186262   2000.786     2013.5 |     n =    7334
         within  |             6.830619   1992.095   2017.744 | T-bar = 23.0363
                 |                                            |
country1 overall |  95.61381   55.60155          1        193 |     N =  168948
         between |             55.71735          1        193 |     n =    7334
         within  |                    0   95.61381   95.61381 | T-bar = 23.0363
                 |                                            |
topic1   overall |      19.5   10.96589          1         38 |     N =  168948
         between |              10.9666          1         38 |     n =    7334
         within  |                    0       19.5       19.5 | T-bar = 23.0363
                 |                                            |
log_gdp  overall |  23.57697   2.441092   16.39547   30.55418 |     N =  163742
         between |             2.395146   17.06457   30.11726 |     n =    7296
         within  |             .5976466   20.28548   25.66845 | T-bar = 22.4427
                 |                                            |
countr~c overall |  3614.825   2112.887          1       7334 |     N =  168948
         between |             2117.288          1       7334 |     n =    7334
         within  |                    0   3614.825   3614.825 | T-bar = 23.0363

. 
. xtreg proportion_of_agenda speech_proportion ib(freq).sc_membership i.year, fe
sc_membership:  string variables may not be used as factor variables
r(109);

end of do-file

r(109);

. do "/var/folders/w3/gyjcgdsx15vc8y_zdl2rd2bh0000gn/T//SD08249.000000"

. encode sc_membership, gen(sc_membership1)

. 
end of do-file

. do "/var/folders/w3/gyjcgdsx15vc8y_zdl2rd2bh0000gn/T//SD08249.000000"

. xtreg proportion_of_agenda speech_proportion ib(freq).sc_membership i.year, fe
sc_membership:  string variables may not be used as factor variables
r(109);

end of do-file

r(109);

. do "/var/folders/w3/gyjcgdsx15vc8y_zdl2rd2bh0000gn/T//SD08249.000000"

. xtreg proportion_of_agenda speech_proportion ib(freq).sc_membership1 i.year, fe
note: 1.sc_membership1 omitted because of collinearity
note: 3.sc_membership1 omitted because of collinearity

Fixed-effects (within) regression               Number of obs     =    160,056
Group variable: country_to~c                    Number of groups  =      6,948

R-sq:                                           Obs per group:
     within  = 0.0248                                         min =          6
     between = 0.5710                                         avg =       23.0
     overall = 0.3957                                         max =         24

                                                F(25,153083)      =     155.41
corr(u_i, Xb)  = -0.6554                        Prob > F          =     0.0000

-----------------------------------------------------------------------------------
proportion_of_a~a |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
------------------+----------------------------------------------------------------
speech_proportion |  -.0345546   .0008263   -41.82   0.000    -.0361742    -.032935
                  |
   sc_membership1 |
           never  |          0  (omitted)
       permanent  |          0  (omitted)
       temporary  |   4.81e-06   .0000915     0.05   0.958    -.0001745    .0001841
                  |
             year |
            1994  |   .0010701   .0001387     7.72   0.000     .0007984    .0013419
            1995  |   .0007887   .0001399     5.64   0.000     .0005145    .0010629
            1996  |   .0010668   .0001381     7.73   0.000     .0007962    .0013375
            1997  |  -.0007982   .0001393    -5.73   0.000    -.0010712   -.0005252
            1998  |    -.00064   .0001385    -4.62   0.000    -.0009115   -.0003686
            1999  |   .0007472    .000138     5.42   0.000     .0004769    .0010176
            2000  |   .0007832   .0001387     5.65   0.000     .0005113    .0010551
            2001  |   .0008788   .0001373     6.40   0.000     .0006097    .0011478
            2002  |   .0003327   .0001371     2.43   0.015     .0000639    .0006014
            2003  |   .0014434   .0001373    10.51   0.000     .0011742    .0017125
            2004  |   .0016739   .0001367    12.24   0.000     .0014059    .0019419
            2005  |   .0021215   .0001383    15.34   0.000     .0018505    .0023925
            2006  |   .0014211   .0001366    10.40   0.000     .0011534    .0016889
            2007  |   .0022714    .000137    16.58   0.000      .002003    .0025399
            2008  |   .0023731   .0001368    17.35   0.000      .002105    .0026412
            2009  |   .0013938   .0001366    10.20   0.000     .0011261    .0016616
            2010  |   .0016534   .0001373    12.04   0.000     .0013842    .0019226
            2011  |   .0021557   .0001367    15.78   0.000     .0018879    .0024235
            2012  |   .0020779   .0001366    15.21   0.000     .0018101    .0023457
            2013  |   .0024211   .0001368    17.69   0.000     .0021529    .0026893
            2014  |   .0022997   .0001372    16.76   0.000     .0020308    .0025686
            2015  |   .0024271   .0001374    17.67   0.000     .0021579    .0026964
            2016  |   .0016472   .0001368    12.04   0.000      .001379    .0019153
                  |
            _cons |     .03134   .0001012   309.63   0.000     .0311416    .0315384
------------------+----------------------------------------------------------------
          sigma_u |  .06358555
          sigma_e |  .00782197
              rho |   .9850929   (fraction of variance due to u_i)
-----------------------------------------------------------------------------------
F test that all u_i=0: F(6947, 153083) = 749.89              Prob > F = 0.0000

. 
end of do-file

. reg 1.sc_membership1 speech_proportion
depvar may not be a factor variable
r(198);

. reg sc_membership1 speech_proportion

      Source |       SS           df       MS      Number of obs   =   160,056
-------------+----------------------------------   F(1, 160054)    =      0.45
       Model |  .102623176         1  .102623176   Prob > F        =    0.5046
    Residual |  36886.7719   160,054  .230464542   R-squared       =    0.0000
-------------+----------------------------------   Adj R-squared   =   -0.0000
       Total |  36886.8745   160,055  .230463744   Root MSE        =    .48007

-----------------------------------------------------------------------------------
   sc_membership1 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
------------------+----------------------------------------------------------------
speech_proportion |   .0129758   .0194453     0.67   0.505    -.0251365    .0510882
            _cons |   2.128994    .001301  1636.43   0.000     2.126444    2.131544
-----------------------------------------------------------------------------------

. reg perm_member speech_proportion

      Source |       SS           df       MS      Number of obs   =   160,056
-------------+----------------------------------   F(1, 160054)    =      1.15
       Model |  .030135071         1  .030135071   Prob > F        =    0.2841
    Residual |  4203.37067   160,054  .026262203   R-squared       =    0.0000
-------------+----------------------------------   Adj R-squared   =    0.0000
       Total |  4203.40081   160,055  .026262227   Root MSE        =    .16206

-----------------------------------------------------------------------------------
      perm_member |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
------------------+----------------------------------------------------------------
speech_proportion |   .0070315   .0065641     1.07   0.284    -.0058341    .0198971
            _cons |   .0268088   .0004392    61.04   0.000      .025948    .0276696
-----------------------------------------------------------------------------------

. reg perm_member year

      Source |       SS           df       MS      Number of obs   =   168,948
-------------+----------------------------------   F(1, 168946)    =      2.75
       Model |  .072274381         1  .072274381   Prob > F        =    0.0971
    Residual |   4436.8508   168,946  .026261946   R-squared       =    0.0000
-------------+----------------------------------   Adj R-squared   =    0.0000
       Total |  4436.92308   168,947  .026262219   Root MSE        =    .16206

------------------------------------------------------------------------------
 perm_member |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        year |   -.000095   .0000572    -1.66   0.097    -.0002072    .0000172
       _cons |   .2173732   .1147628     1.89   0.058    -.0075594    .4423058
------------------------------------------------------------------------------

. do "/var/folders/w3/gyjcgdsx15vc8y_zdl2rd2bh0000gn/T//SD08249.000000"

. xtreg proportion_of_agenda speech_proportion temp_member i.year, fe

Fixed-effects (within) regression               Number of obs     =    160,056
Group variable: country_to~c                    Number of groups  =      6,948

R-sq:                                           Obs per group:
     within  = 0.0248                                         min =          6
     between = 0.5710                                         avg =       23.0
     overall = 0.3957                                         max =         24

                                                F(25,153083)      =     155.41
corr(u_i, Xb)  = -0.6554                        Prob > F          =     0.0000

-----------------------------------------------------------------------------------
proportion_of_a~a |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
------------------+----------------------------------------------------------------
speech_proportion |  -.0345546   .0008263   -41.82   0.000    -.0361742    -.032935
      temp_member |   4.81e-06   .0000915     0.05   0.958    -.0001745    .0001841
                  |
             year |
            1994  |   .0010701   .0001387     7.72   0.000     .0007984    .0013419
            1995  |   .0007887   .0001399     5.64   0.000     .0005145    .0010629
            1996  |   .0010668   .0001381     7.73   0.000     .0007962    .0013375
            1997  |  -.0007982   .0001393    -5.73   0.000    -.0010712   -.0005252
            1998  |    -.00064   .0001385    -4.62   0.000    -.0009115   -.0003686
            1999  |   .0007472    .000138     5.42   0.000     .0004769    .0010176
            2000  |   .0007832   .0001387     5.65   0.000     .0005113    .0010551
            2001  |   .0008788   .0001373     6.40   0.000     .0006097    .0011478
            2002  |   .0003327   .0001371     2.43   0.015     .0000639    .0006014
            2003  |   .0014434   .0001373    10.51   0.000     .0011742    .0017125
            2004  |   .0016739   .0001367    12.24   0.000     .0014059    .0019419
            2005  |   .0021215   .0001383    15.34   0.000     .0018505    .0023925
            2006  |   .0014211   .0001366    10.40   0.000     .0011534    .0016889
            2007  |   .0022714    .000137    16.58   0.000      .002003    .0025399
            2008  |   .0023731   .0001368    17.35   0.000      .002105    .0026412
            2009  |   .0013938   .0001366    10.20   0.000     .0011261    .0016616
            2010  |   .0016534   .0001373    12.04   0.000     .0013842    .0019226
            2011  |   .0021557   .0001367    15.78   0.000     .0018879    .0024235
            2012  |   .0020779   .0001366    15.21   0.000     .0018101    .0023457
            2013  |   .0024211   .0001368    17.69   0.000     .0021529    .0026893
            2014  |   .0022997   .0001372    16.76   0.000     .0020308    .0025686
            2015  |   .0024271   .0001374    17.67   0.000     .0021579    .0026964
            2016  |   .0016472   .0001368    12.04   0.000      .001379    .0019153
                  |
            _cons |     .03134   .0001012   309.63   0.000     .0311416    .0315384
------------------+----------------------------------------------------------------
          sigma_u |  .06358555
          sigma_e |  .00782197
              rho |   .9850929   (fraction of variance due to u_i)
-----------------------------------------------------------------------------------
F test that all u_i=0: F(6947, 153083) = 749.89              Prob > F = 0.0000

. 
end of do-file

. do "/var/folders/w3/gyjcgdsx15vc8y_zdl2rd2bh0000gn/T//SD08249.000000"

. xtreg proportion_of_agenda speech_proportion temp_member log_gdp i.year, fe

Fixed-effects (within) regression               Number of obs     =    155,124
Group variable: country_to~c                    Number of groups  =      6,912

R-sq:                                           Obs per group:
     within  = 0.0255                                         min =          4
     between = 0.5678                                         avg =       22.4
     overall = 0.3987                                         max =         24

                                                F(26,148186)      =     149.33
corr(u_i, Xb)  = -0.6581                        Prob > F          =     0.0000

-----------------------------------------------------------------------------------
proportion_of_a~a |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
------------------+----------------------------------------------------------------
speech_proportion |  -.0356559    .000838   -42.55   0.000    -.0372983   -.0340135
      temp_member |   4.38e-06   .0000915     0.05   0.962     -.000175    .0001837
          log_gdp |   9.03e-06   .0000736     0.12   0.902    -.0001352    .0001532
                  |
             year |
            1994  |   .0010697   .0001427     7.50   0.000       .00079    .0013493
            1995  |   .0007871   .0001432     5.50   0.000     .0005065    .0010677
            1996  |   .0010638   .0001419     7.50   0.000     .0007858    .0013419
            1997  |  -.0008013   .0001433    -5.59   0.000    -.0010822   -.0005203
            1998  |  -.0006428   .0001427    -4.50   0.000    -.0009224   -.0003631
            1999  |   .0007434   .0001422     5.23   0.000     .0004647     .001022
            2000  |   .0007791   .0001434     5.43   0.000      .000498    .0010603
            2001  |   .0008745   .0001419     6.16   0.000     .0005964    .0011526
            2002  |   .0003279   .0001426     2.30   0.021     .0000484    .0006074
            2003  |   .0014377   .0001453     9.90   0.000     .0011529    .0017224
            2004  |    .001667   .0001476    11.29   0.000     .0013777    .0019563
            2005  |   .0021131   .0001528    13.83   0.000     .0018137    .0024124
            2006  |    .001412   .0001552     9.10   0.000     .0011077    .0017162
            2007  |    .002261    .000161    14.04   0.000     .0019454    .0025766
            2008  |   .0023618   .0001671    14.14   0.000     .0020343    .0026893
            2009  |   .0013832    .000165     8.38   0.000     .0010599    .0017066
            2010  |   .0016415   .0001696     9.68   0.000     .0013091    .0019739
            2011  |   .0021423   .0001745    12.27   0.000     .0018002    .0024845
            2012  |   .0020642   .0001763    11.71   0.000     .0017187    .0024097
            2013  |   .0024072   .0001788    13.46   0.000     .0020567    .0027577
            2014  |   .0022852   .0001809    12.63   0.000     .0019306    .0026398
            2015  |    .002414   .0001777    13.58   0.000     .0020656    .0027624
            2016  |   .0016344   .0001782     9.17   0.000     .0012851    .0019838
                  |
            _cons |   .0311628   .0016788    18.56   0.000     .0278723    .0344533
------------------+----------------------------------------------------------------
          sigma_u |  .06360308
          sigma_e |  .00778147
              rho |  .98525265   (fraction of variance due to u_i)
-----------------------------------------------------------------------------------
F test that all u_i=0: F(6911, 148186) = 738.92              Prob > F = 0.0000

. #perm_member c.speech_proportion#temp_member i.year, fe
Unknown #command
. 
end of do-file

. do "/var/folders/w3/gyjcgdsx15vc8y_zdl2rd2bh0000gn/T//SD08249.000000"

. xtreg proportion_of_agenda speech_proportion temp_member c.speech_proportion#perm_member 
> c.speech_proportion#temp_member i.year, fe

Fixed-effects (within) regression               Number of obs     =    160,056
Group variable: country_to~c                    Number of groups  =      6,948

R-sq:                                           Obs per group:
     within  = 0.0249                                         min =          6
     between = 0.5667                                         avg =       23.0
     overall = 0.3935                                         max =         24

                                                F(27,153081)      =     144.72
corr(u_i, Xb)  = -0.6538                        Prob > F          =     0.0000

-------------------------------------------------------------------------------------
proportion_of_age~a |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
--------------------+----------------------------------------------------------------
  speech_proportion |  -.0350924    .000843   -41.63   0.000    -.0367447   -.0334401
        temp_member |   .0000574   .0000996     0.58   0.565    -.0001379    .0002526
                    |
        perm_member#|
c.speech_proportion |
                 1  |   .0214668   .0048434     4.43   0.000     .0119739    .0309598
                    |
        temp_member#|
c.speech_proportion |
                 1  |  -.0020173    .001518    -1.33   0.184    -.0049926    .0009579
                    |
               year |
              1994  |   .0010699   .0001386     7.72   0.000     .0007981    .0013416
              1995  |   .0007885   .0001399     5.64   0.000     .0005144    .0010627
              1996  |   .0010666   .0001381     7.73   0.000      .000796    .0013373
              1997  |  -.0007986   .0001393    -5.73   0.000    -.0010715   -.0005256
              1998  |  -.0006402   .0001385    -4.62   0.000    -.0009116   -.0003688
              1999  |   .0007473   .0001379     5.42   0.000     .0004769    .0010176
              2000  |   .0007826   .0001387     5.64   0.000     .0005107    .0010545
              2001  |   .0008782   .0001372     6.40   0.000     .0006092    .0011472
              2002  |   .0003321   .0001371     2.42   0.015     .0000634    .0006008
              2003  |   .0014431   .0001373    10.51   0.000      .001174    .0017122
              2004  |   .0016735   .0001367    12.24   0.000     .0014055    .0019414
              2005  |   .0021211   .0001383    15.34   0.000     .0018501    .0023922
              2006  |   .0014205   .0001366    10.40   0.000     .0011528    .0016883
              2007  |   .0022717    .000137    16.59   0.000     .0020032    .0025402
              2008  |   .0023728   .0001368    17.35   0.000     .0021047    .0026409
              2009  |   .0013937   .0001366    10.20   0.000      .001126    .0016615
              2010  |    .001653   .0001373    12.04   0.000     .0013838    .0019221
              2011  |   .0021555   .0001366    15.77   0.000     .0018876    .0024233
              2012  |   .0020779   .0001366    15.21   0.000     .0018101    .0023457
              2013  |   .0024205   .0001368    17.69   0.000     .0021523    .0026887
              2014  |   .0022992   .0001372    16.76   0.000     .0020303    .0025681
              2015  |   .0024268   .0001374    17.67   0.000     .0021575     .002696
              2016  |   .0016466   .0001368    12.03   0.000     .0013784    .0019148
                    |
              _cons |   .0313387   .0001012   309.58   0.000     .0311402    .0315371
--------------------+----------------------------------------------------------------
            sigma_u |  .06359115
            sigma_e |  .00782147
                rho |  .98509737   (fraction of variance due to u_i)
-------------------------------------------------------------------------------------
F test that all u_i=0: F(6947, 153081) = 749.59              Prob > F = 0.0000

. 
end of do-file

. do "/var/folders/w3/gyjcgdsx15vc8y_zdl2rd2bh0000gn/T//SD08249.000000"

. xtreg proportion_of_agenda speech_proportion temp_member c.speech_proportion#temp_member 
> c.speech_proportion#temp_member i.year, fe

Fixed-effects (within) regression               Number of obs     =    160,056
Group variable: country_to~c                    Number of groups  =      6,948

R-sq:                                           Obs per group:
     within  = 0.0248                                         min =          6
     between = 0.5712                                         avg =       23.0
     overall = 0.3958                                         max =         24

                                                F(26,153082)      =     149.51
corr(u_i, Xb)  = -0.6554                        Prob > F          =     0.0000

-------------------------------------------------------------------------------------
proportion_of_age~a |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
--------------------+----------------------------------------------------------------
  speech_proportion |   -.034442   .0008302   -41.49   0.000    -.0360693   -.0328148
        temp_member |   .0000603   .0000996     0.61   0.545     -.000135    .0002555
                    |
        temp_member#|
c.speech_proportion |
                 1  |  -.0021321   .0015179    -1.40   0.160    -.0051071    .0008428
                    |
               year |
              1994  |   .0010701   .0001387     7.72   0.000     .0007983    .0013419
              1995  |   .0007886   .0001399     5.64   0.000     .0005145    .0010628
              1996  |   .0010668   .0001381     7.73   0.000     .0007961    .0013374
              1997  |  -.0007983   .0001393    -5.73   0.000    -.0010713   -.0005253
              1998  |  -.0006402   .0001385    -4.62   0.000    -.0009116   -.0003688
              1999  |   .0007471    .000138     5.42   0.000     .0004767    .0010175
              2000  |   .0007831   .0001387     5.65   0.000     .0005112     .001055
              2001  |   .0008786   .0001373     6.40   0.000     .0006096    .0011477
              2002  |   .0003326   .0001371     2.43   0.015     .0000639    .0006013
              2003  |   .0014434   .0001373    10.51   0.000     .0011742    .0017125
              2004  |   .0016739   .0001367    12.24   0.000     .0014059    .0019419
              2005  |   .0021214   .0001383    15.34   0.000     .0018504    .0023925
              2006  |    .001421   .0001366    10.40   0.000     .0011533    .0016888
              2007  |   .0022714    .000137    16.58   0.000      .002003    .0025399
              2008  |   .0023731   .0001368    17.35   0.000      .002105    .0026412
              2009  |   .0013938   .0001366    10.20   0.000      .001126    .0016615
              2010  |   .0016533   .0001373    12.04   0.000     .0013841    .0019224
              2011  |   .0021556   .0001367    15.77   0.000     .0018878    .0024235
              2012  |   .0020779   .0001366    15.21   0.000       .00181    .0023457
              2013  |    .002421   .0001368    17.69   0.000     .0021528    .0026892
              2014  |   .0022996   .0001372    16.76   0.000     .0020307    .0025686
              2015  |   .0024272   .0001374    17.67   0.000     .0021579    .0026964
              2016  |    .001647   .0001368    12.04   0.000     .0013788    .0019152
                    |
              _cons |   .0313372   .0001012   309.54   0.000     .0311387    .0315356
--------------------+----------------------------------------------------------------
            sigma_u |  .06358548
            sigma_e |  .00782195
                rho |  .98509296   (fraction of variance due to u_i)
-------------------------------------------------------------------------------------
F test that all u_i=0: F(6947, 153082) = 749.78              Prob > F = 0.0000

. 
end of do-file

. do "/var/folders/w3/gyjcgdsx15vc8y_zdl2rd2bh0000gn/T//SD08249.000000"

. 
. * Agenda_proportion = Speech_proportion + temp_member_dummy + log_gdp w/ year and country
> -topic fixed effects
. xtreg proportion_of_agenda speech_proportion temp_member log_gdp i.year, fe

Fixed-effects (within) regression               Number of obs     =    155,124
Group variable: country_to~c                    Number of groups  =      6,912

R-sq:                                           Obs per group:
     within  = 0.0255                                         min =          4
     between = 0.5678                                         avg =       22.4
     overall = 0.3987                                         max =         24

                                                F(26,148186)      =     149.33
corr(u_i, Xb)  = -0.6581                        Prob > F          =     0.0000

-----------------------------------------------------------------------------------
proportion_of_a~a |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
------------------+----------------------------------------------------------------
speech_proportion |  -.0356559    .000838   -42.55   0.000    -.0372983   -.0340135
      temp_member |   4.38e-06   .0000915     0.05   0.962     -.000175    .0001837
          log_gdp |   9.03e-06   .0000736     0.12   0.902    -.0001352    .0001532
                  |
             year |
            1994  |   .0010697   .0001427     7.50   0.000       .00079    .0013493
            1995  |   .0007871   .0001432     5.50   0.000     .0005065    .0010677
            1996  |   .0010638   .0001419     7.50   0.000     .0007858    .0013419
            1997  |  -.0008013   .0001433    -5.59   0.000    -.0010822   -.0005203
            1998  |  -.0006428   .0001427    -4.50   0.000    -.0009224   -.0003631
            1999  |   .0007434   .0001422     5.23   0.000     .0004647     .001022
            2000  |   .0007791   .0001434     5.43   0.000      .000498    .0010603
            2001  |   .0008745   .0001419     6.16   0.000     .0005964    .0011526
            2002  |   .0003279   .0001426     2.30   0.021     .0000484    .0006074
            2003  |   .0014377   .0001453     9.90   0.000     .0011529    .0017224
            2004  |    .001667   .0001476    11.29   0.000     .0013777    .0019563
            2005  |   .0021131   .0001528    13.83   0.000     .0018137    .0024124
            2006  |    .001412   .0001552     9.10   0.000     .0011077    .0017162
            2007  |    .002261    .000161    14.04   0.000     .0019454    .0025766
            2008  |   .0023618   .0001671    14.14   0.000     .0020343    .0026893
            2009  |   .0013832    .000165     8.38   0.000     .0010599    .0017066
            2010  |   .0016415   .0001696     9.68   0.000     .0013091    .0019739
            2011  |   .0021423   .0001745    12.27   0.000     .0018002    .0024845
            2012  |   .0020642   .0001763    11.71   0.000     .0017187    .0024097
            2013  |   .0024072   .0001788    13.46   0.000     .0020567    .0027577
            2014  |   .0022852   .0001809    12.63   0.000     .0019306    .0026398
            2015  |    .002414   .0001777    13.58   0.000     .0020656    .0027624
            2016  |   .0016344   .0001782     9.17   0.000     .0012851    .0019838
                  |
            _cons |   .0311628   .0016788    18.56   0.000     .0278723    .0344533
------------------+----------------------------------------------------------------
          sigma_u |  .06360308
          sigma_e |  .00778147
              rho |  .98525265   (fraction of variance due to u_i)
-----------------------------------------------------------------------------------
F test that all u_i=0: F(6911, 148186) = 738.92              Prob > F = 0.0000

. outreg2 using table1, tex replace title(Table 1: All resolutions) ctitle(1) paren se bdec
> (3) nocons
table1.tex
dir : seeout

. 
. * Add interactions for Speech_proportion * temp_member
. xtreg proportion_of_agenda speech_proportion temp_member log_gdp c.speech_proportion#temp
> _member i.year, fe

Fixed-effects (within) regression               Number of obs     =    155,124
Group variable: country_to~c                    Number of groups  =      6,912

R-sq:                                           Obs per group:
     within  = 0.0255                                         min =          4
     between = 0.5680                                         avg =       22.4
     overall = 0.3988                                         max =         24

                                                F(27,148185)      =     143.85
corr(u_i, Xb)  = -0.6581                        Prob > F          =     0.0000

-------------------------------------------------------------------------------------
proportion_of_age~a |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
--------------------+----------------------------------------------------------------
  speech_proportion |  -.0355606    .000842   -42.23   0.000    -.0372108   -.0339103
        temp_member |   .0000504   .0000997     0.51   0.613     -.000145    .0002458
            log_gdp |   9.04e-06   .0000736     0.12   0.902    -.0001352    .0001532
                    |
        temp_member#|
c.speech_proportion |
                 1  |  -.0017707   .0015216    -1.16   0.245     -.004753    .0012115
                    |
               year |
              1994  |   .0010696   .0001427     7.50   0.000       .00079    .0013493
              1995  |   .0007871   .0001432     5.50   0.000     .0005065    .0010677
              1996  |   .0010638   .0001419     7.50   0.000     .0007858    .0013418
              1997  |  -.0008014   .0001433    -5.59   0.000    -.0010823   -.0005205
              1998  |  -.0006429   .0001427    -4.51   0.000    -.0009226   -.0003632
              1999  |   .0007432   .0001422     5.23   0.000     .0004646    .0010219
              2000  |   .0007791   .0001434     5.43   0.000     .0004979    .0010602
              2001  |   .0008744   .0001419     6.16   0.000     .0005963    .0011525
              2002  |   .0003278   .0001426     2.30   0.022     .0000483    .0006074
              2003  |   .0014377   .0001453     9.90   0.000     .0011529    .0017224
              2004  |    .001667   .0001476    11.29   0.000     .0013776    .0019563
              2005  |    .002113   .0001528    13.83   0.000     .0018136    .0024124
              2006  |   .0014118   .0001552     9.09   0.000     .0011076    .0017161
              2007  |    .002261    .000161    14.04   0.000     .0019454    .0025766
              2008  |   .0023618   .0001671    14.14   0.000     .0020343    .0026892
              2009  |   .0013832    .000165     8.38   0.000     .0010598    .0017065
              2010  |   .0016414   .0001696     9.68   0.000      .001309    .0019738
              2011  |   .0021423   .0001745    12.27   0.000     .0018002    .0024844
              2012  |   .0020642   .0001763    11.71   0.000     .0017187    .0024097
              2013  |   .0024071   .0001788    13.46   0.000     .0020565    .0027576
              2014  |   .0022852   .0001809    12.63   0.000     .0019306    .0026398
              2015  |    .002414   .0001777    13.58   0.000     .0020656    .0027624
              2016  |   .0016343   .0001782     9.17   0.000     .0012849    .0019836
                    |
              _cons |   .0311601   .0016788    18.56   0.000     .0278696    .0344506
--------------------+----------------------------------------------------------------
            sigma_u |  .06360297
            sigma_e |  .00778146
                rho |  .98525263   (fraction of variance due to u_i)
-------------------------------------------------------------------------------------
F test that all u_i=0: F(6911, 148185) = 738.81              Prob > F = 0.0000

. outreg2 using table1, tex append ctitle(2) paren se bdec(3)
table1.tex
dir : seeout

. 
. * Add another interaction for GDP * temp_member
. xtreg proportion_of_agenda speech_proportion temp_member log_gdp c.speech_proportion#temp
> _member c.log_gdp#temp_member i.year, fe

Fixed-effects (within) regression               Number of obs     =    155,124
Group variable: country_to~c                    Number of groups  =      6,912

R-sq:                                           Obs per group:
     within  = 0.0255                                         min =          4
     between = 0.5680                                         avg =       22.4
     overall = 0.3988                                         max =         24

                                                F(28,148184)      =     138.71
corr(u_i, Xb)  = -0.6581                        Prob > F          =     0.0000

---------------------------------------------------------------------------------------
 proportion_of_agenda |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
----------------------+----------------------------------------------------------------
    speech_proportion |  -.0355606    .000842   -42.23   0.000    -.0372108   -.0339103
          temp_member |   .0000709   .0011032     0.06   0.949    -.0020914    .0022332
              log_gdp |   9.06e-06   .0000736     0.12   0.902    -.0001352    .0001533
                      |
          temp_member#|
  c.speech_proportion |
                   1  |  -.0017707   .0015216    -1.16   0.245    -.0047529    .0012116
                      |
temp_member#c.log_gdp |
                   1  |  -8.17e-07   .0000438    -0.02   0.985    -.0000868    .0000851
                      |
                 year |
                1994  |   .0010696   .0001427     7.50   0.000     .0007899    .0013493
                1995  |   .0007871   .0001432     5.50   0.000     .0005065    .0010677
                1996  |   .0010638   .0001419     7.50   0.000     .0007858    .0013418
                1997  |  -.0008014   .0001433    -5.59   0.000    -.0010823   -.0005204
                1998  |  -.0006429   .0001427    -4.51   0.000    -.0009226   -.0003632
                1999  |   .0007432   .0001422     5.23   0.000     .0004646    .0010219
                2000  |   .0007791   .0001434     5.43   0.000     .0004979    .0010602
                2001  |   .0008744   .0001419     6.16   0.000     .0005962    .0011525
                2002  |   .0003278   .0001426     2.30   0.022     .0000483    .0006073
                2003  |   .0014377   .0001453     9.90   0.000     .0011529    .0017224
                2004  |    .001667   .0001476    11.29   0.000     .0013776    .0019564
                2005  |    .002113   .0001528    13.83   0.000     .0018136    .0024124
                2006  |   .0014119   .0001552     9.09   0.000     .0011076    .0017161
                2007  |    .002261    .000161    14.04   0.000     .0019454    .0025766
                2008  |   .0023618   .0001671    14.14   0.000     .0020343    .0026893
                2009  |   .0013832    .000165     8.38   0.000     .0010598    .0017066
                2010  |   .0016414   .0001696     9.68   0.000      .001309    .0019739
                2011  |   .0021423   .0001746    12.27   0.000     .0018002    .0024845
                2012  |   .0020642   .0001763    11.71   0.000     .0017187    .0024097
                2013  |   .0024071   .0001788    13.46   0.000     .0020565    .0027576
                2014  |   .0022852   .0001809    12.63   0.000     .0019306    .0026398
                2015  |    .002414   .0001778    13.58   0.000     .0020656    .0027624
                2016  |   .0016343   .0001783     9.17   0.000     .0012849    .0019837
                      |
                _cons |   .0311596   .0016791    18.56   0.000     .0278686    .0344506
----------------------+----------------------------------------------------------------
              sigma_u |  .06360297
              sigma_e |  .00778148
                  rho |  .98525253   (fraction of variance due to u_i)
---------------------------------------------------------------------------------------
F test that all u_i=0: F(6911, 148184) = 738.80              Prob > F = 0.0000

. outreg2 using table1, tex append ctitle(3) paren se bdec(3)
table1.tex
dir : seeout

. 
end of do-file

. do "/var/folders/w3/gyjcgdsx15vc8y_zdl2rd2bh0000gn/T//SD08249.000000"

. * Leslie Huang
. 
. * set up the workspace
. clear all

. set more off

. cd "/Users/lesliehuang/un-analysis-reg/"
/Users/lesliehuang/un-analysis-reg

. capture log close
