---------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /Users/lesliehuang/un-analysis-reg/un_log_voting.log
  log type:  text
 opened on:  28 Nov 2017, 12:11:56

. 
. set seed 1234

. 
. * import data
. import delimited data_by_country_year_topic_voting_only
(12 vars, 168948 obs)

. 
. encode country, gen(country1)

. encode topic, gen(topic1)

. 
. gen log_gdp = log(gdp)
(5,206 missing values generated)

. 
. gen speech_pct = 100 * speech_proportion
(8,892 missing values generated)

. gen agenda_pct = 100 * agenda_proportion
agenda_proportion not found
r(111);

end of do-file

r(111);

. do "/var/folders/w3/gyjcgdsx15vc8y_zdl2rd2bh0000gn/T//SD01139.000000"

. gen agenda_pct = 100 * proportion_of_agenda

. 
. encode sc_membership, gen(sc_membership1)

. 
. egen country_topic = group(country1 topic1)

. 
. xtset country_topic year
       panel variable:  country_topic (unbalanced)
        time variable:  year, 1993 to 2016, but with gaps
                delta:  1 unit

. 
. *Inspect panel
. *xtsum
. 
. * perm_member does not vary over time so cannot include it
. 
. * Agenda_proportion = Speech_proportion + temp_member_dummy + log_gdp w/ year and cou
> ntry-topic fixed effects
. xtreg proportion_of_agenda speech_proportion temp_member log_gdp i.year, fe

Fixed-effects (within) regression               Number of obs     =    155,124
Group variable: country_to~c                    Number of groups  =      6,912

R-sq:                                           Obs per group:
     within  = 0.0139                                         min =          4
     between = 0.0540                                         avg =       22.4
     overall = 0.0383                                         max =         24

                                                F(26,148186)      =      80.27
corr(u_i, Xb)  = -0.2720                        Prob > F          =     0.0000

-----------------------------------------------------------------------------------
proportion_of_a~a |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
------------------+----------------------------------------------------------------
speech_proportion |  -.0846668   .0020193   -41.93   0.000    -.0886245    -.080709
      temp_member |   6.64e-06   .0002205     0.03   0.976    -.0004256    .0004388
          log_gdp |   .0000135   .0001773     0.08   0.939     -.000334     .000361
                  |
             year |
            1994  |   .0047883   .0003438    13.93   0.000     .0041144    .0054622
            1995  |   .0014677    .000345     4.25   0.000     .0007916    .0021439
            1996  |   .0018064   .0003418     5.28   0.000     .0011364    .0024763
            1997  |   .0021119   .0003454     6.11   0.000     .0014349    .0027889
            1998  |    .002654   .0003438     7.72   0.000     .0019802    .0033279
            1999  |   .0028365   .0003426     8.28   0.000     .0021651    .0035079
            2000  |   .0021923   .0003456     6.34   0.000     .0015149    .0028698
            2001  |   .0026253    .000342     7.68   0.000     .0019551    .0032955
            2002  |    .003002   .0003436     8.74   0.000     .0023284    .0036755
            2003  |   .0024466   .0003501     6.99   0.000     .0017604    .0031328
            2004  |   .0031217   .0003557     8.78   0.000     .0024245    .0038189
            2005  |    .002786   .0003681     7.57   0.000     .0020645    .0035074
            2006  |   .0025643   .0003741     6.85   0.000     .0018311    .0032975
            2007  |   .0018743    .000388     4.83   0.000     .0011139    .0026348
            2008  |   .0019517   .0004026     4.85   0.000     .0011626    .0027408
            2009  |   .0012861   .0003976     3.24   0.001     .0005069    .0020653
            2010  |   .0018531   .0004087     4.53   0.000     .0010521    .0026541
            2011  |   .0012446   .0004206     2.96   0.003     .0004202     .002069
            2012  |   .0030661   .0004248     7.22   0.000     .0022335    .0038986
            2013  |   .0015081    .000431     3.50   0.000     .0006634    .0023527
            2014  |   .0018116    .000436     4.16   0.000     .0009571     .002666
            2015  |   .0021431   .0004283     5.00   0.000     .0013036    .0029826
            2016  |   .0017191   .0004295     4.00   0.000     .0008773     .002561
                  |
            _cons |   .0315822   .0040455     7.81   0.000     .0236531    .0395114
------------------+----------------------------------------------------------------
          sigma_u |  .07195355
          sigma_e |  .01875115
              rho |  .93640609   (fraction of variance due to u_i)
-----------------------------------------------------------------------------------
F test that all u_i=0: F(6911, 148186) = 305.10              Prob > F = 0.0000

. treg agenda_pct speech_pct temp_member log_gdp c.speech_proportion#temp_member c.log_
> gdp#temp_member i.year, fe
command treg is unrecognized
r(199);

end of do-file

r(199);

. do "/var/folders/w3/gyjcgdsx15vc8y_zdl2rd2bh0000gn/T//SD01139.000000"

. xtreg agenda_pct speech_pct temp_member log_gdp i.year, fe

Fixed-effects (within) regression               Number of obs     =    155,124
Group variable: country_to~c                    Number of groups  =      6,912

R-sq:                                           Obs per group:
     within  = 0.0139                                         min =          4
     between = 0.0540                                         avg =       22.4
     overall = 0.0383                                         max =         24

                                                F(26,148186)      =      80.27
corr(u_i, Xb)  = -0.2720                        Prob > F          =     0.0000

------------------------------------------------------------------------------
  agenda_pct |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
  speech_pct |  -.0846668   .0020193   -41.93   0.000    -.0886245    -.080709
 temp_member |   .0006639   .0220515     0.03   0.976    -.0425566    .0438843
     log_gdp |   .0013519   .0177285     0.08   0.939    -.0333956    .0360995
             |
        year |
       1994  |    .478831   .0343842    13.93   0.000     .4114388    .5462233
       1995  |   .1467738   .0344989     4.25   0.000     .0791567    .2143909
       1996  |   .1806379   .0341821     5.28   0.000     .1136417    .2476341
       1997  |   .2111922   .0345414     6.11   0.000     .1434917    .2788926
       1998  |   .2654044   .0343826     7.72   0.000     .1980151    .3327937
       1999  |   .2836498   .0342573     8.28   0.000     .2165062    .3507934
       2000  |   .2192321    .034564     6.34   0.000     .1514873    .2869769
       2001  |    .262531   .0341958     7.68   0.000      .195508     .329554
       2002  |   .3001951   .0343642     8.74   0.000     .2328419    .3675483
       2003  |   .2446635   .0350101     6.99   0.000     .1760443    .3132826
       2004  |   .3121725   .0355725     8.78   0.000     .2424511    .3818939
       2005  |   .2785994   .0368091     7.57   0.000     .2064542    .3507445
       2006  |   .2564307   .0374085     6.85   0.000     .1831108    .3297506
       2007  |   .1874337   .0387987     4.83   0.000      .111389    .2634785
       2008  |   .1951722    .040261     4.85   0.000     .1162613     .274083
       2009  |   .1286129   .0397553     3.24   0.001     .0506933    .2065325
       2010  |    .185308   .0408681     4.53   0.000     .1052074    .2654086
       2011  |   .1244564   .0420612     2.96   0.003     .0420172    .2068956
       2012  |   .3066083   .0424768     7.22   0.000     .2233547    .3898619
       2013  |    .150807   .0430952     3.50   0.000     .0663413    .2352726
       2014  |   .1811578   .0435955     4.16   0.000     .0957114    .2666041
       2015  |   .2143123   .0428326     5.00   0.000     .1303612    .2982634
       2016  |   .1719137   .0429517     4.00   0.000     .0877293    .2560981
             |
       _cons |   3.158224   .4045519     7.81   0.000      2.36531    3.951137
-------------+----------------------------------------------------------------
     sigma_u |  7.1953546
     sigma_e |  1.8751147
         rho |  .93640609   (fraction of variance due to u_i)
------------------------------------------------------------------------------
F test that all u_i=0: F(6911, 148186) = 305.10              Prob > F = 0.0000

. outreg2 using table_voting, tex replace title(Table 1: All resolutions) ctitle(1) par
> en se bdec(3) nocons
table_voting.tex
dir : seeout

. 
. * Add interactions for Speech_proportion * temp_member
. xtreg agenda_pct speech_pct temp_member log_gdp c.speech_proportion#temp_member i.yea
> r, fe
note: 1.temp_member#c.speech_proportion omitted because of collinearity

Fixed-effects (within) regression               Number of obs     =    155,124
Group variable: country_to~c                    Number of groups  =      6,912

R-sq:                                           Obs per group:
     within  = 0.0139                                         min =          4
     between = 0.0540                                         avg =       22.4
     overall = 0.0383                                         max =         24

                                                F(27,148185)      =      77.47
corr(u_i, Xb)  = -0.2720                        Prob > F          =     0.0000

-------------------------------------------------------------------------------------
         agenda_pct |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
--------------------+----------------------------------------------------------------
         speech_pct |  -.0920422   .0040139   -22.93   0.000    -.0999094   -.0841749
        temp_member |   .0209331   .0240239     0.87   0.384    -.0261533    .0680194
            log_gdp |   .0013574   .0177283     0.08   0.939    -.0333898    .0361045
                    |
        temp_member#|
c.speech_proportion |
                 0  |   .7795206   .3666496     2.13   0.033     .0608947    1.498146
                 1  |          0  (omitted)
                    |
               year |
              1994  |   .4788109   .0343837    13.93   0.000     .4114194    .5462024
              1995  |   .1467513   .0344985     4.25   0.000     .0791351    .2143676
              1996  |   .1806117   .0341817     5.28   0.000     .1136163    .2476071
              1997  |   .2111449    .034541     6.11   0.000     .1434452    .2788446
              1998  |   .2653404   .0343822     7.72   0.000     .1979519    .3327289
              1999  |   .2835963   .0342569     8.28   0.000     .2164535    .3507391
              2000  |   .2192092   .0345636     6.34   0.000     .1514652    .2869532
              2001  |   .2624828   .0341954     7.68   0.000     .1954605     .329505
              2002  |   .3001657   .0343638     8.73   0.000     .2328133    .3675181
              2003  |   .2446599   .0350097     6.99   0.000     .1760416    .3132782
              2004  |   .3121604   .0355721     8.78   0.000     .2424399     .381881
              2005  |   .2785672   .0368087     7.57   0.000     .2064229    .3507115
              2006  |   .2563842   .0374081     6.85   0.000     .1830652    .3297033
              2007  |    .187424   .0387983     4.83   0.000     .1113802    .2634678
              2008  |    .195161   .0402606     4.85   0.000     .1162511    .2740709
              2009  |   .1285832   .0397548     3.23   0.001     .0506645    .2065019
              2010  |   .1852511   .0408676     4.53   0.000     .1051514    .2653508
              2011  |   .1244227   .0420607     2.96   0.003     .0419845    .2068609
              2012  |   .3065831   .0424763     7.22   0.000     .2233305    .3898358
              2013  |   .1507568   .0430946     3.50   0.000     .0662921    .2352214
              2014  |   .1811336    .043595     4.15   0.000     .0956882     .266579
              2015  |   .2143104   .0428321     5.00   0.000     .1303603    .2982605
              2016  |   .1718489   .0429512     4.00   0.000     .0876655    .2560323
                    |
              _cons |   3.157045   .4045475     7.80   0.000      2.36414     3.94995
--------------------+----------------------------------------------------------------
            sigma_u |  7.1953494
            sigma_e |  1.8750924
                rho |  .93640742   (fraction of variance due to u_i)
-------------------------------------------------------------------------------------
F test that all u_i=0: F(6911, 148185) = 305.11              Prob > F = 0.0000

. outreg2 using table_voting, tex append ctitle(2) paren se bdec(3)
table_voting.tex
dir : seeout

. 
. * Add another interaction for GDP * temp_member
. xtreg agenda_pct speech_pct temp_member log_gdp c.speech_proportion#temp_member c.log
> _gdp#temp_member i.year, fe
note: 1.temp_member#c.speech_proportion omitted because of collinearity

Fixed-effects (within) regression               Number of obs     =    155,124
Group variable: country_to~c                    Number of groups  =      6,912

R-sq:                                           Obs per group:
     within  = 0.0139                                         min =          4
     between = 0.0540                                         avg =       22.4
     overall = 0.0383                                         max =         24

                                                F(28,148184)      =      74.70
corr(u_i, Xb)  = -0.2720                        Prob > F          =     0.0000

-------------------------------------------------------------------------------------
         agenda_pct |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
--------------------+----------------------------------------------------------------
         speech_pct |   -.092042    .004014   -22.93   0.000    -.0999093   -.0841747
        temp_member |   .0266023   .2658394     0.10   0.920    -.4944377    .5476422
            log_gdp |   .0013635   .0177307     0.08   0.939    -.0333883    .0361153
                    |
        temp_member#|
c.speech_proportion |
                 0  |   .7795004    .366652     2.13   0.034     .0608697    1.498131
                 1  |          0  (omitted)
                    |
        temp_member#|
          c.log_gdp |
                 1  |  -.0002263   .0105664    -0.02   0.983    -.0209362    .0204837
                    |
               year |
              1994  |   .4788056   .0343847    13.92   0.000     .4114122     .546199
              1995  |   .1467518   .0344986     4.25   0.000     .0791353    .2143684
              1996  |    .180616   .0341824     5.28   0.000     .1136192    .2476128
              1997  |   .2111495   .0345418     6.11   0.000     .1434482    .2788507
              1998  |   .2653378   .0343826     7.72   0.000     .1979487     .332727
              1999  |   .2835935   .0342573     8.28   0.000       .21645     .350737
              2000  |   .2192073   .0345639     6.34   0.000     .1514628    .2869517
              2001  |   .2624774   .0341964     7.68   0.000     .1954531    .3295016
              2002  |   .3001626   .0343642     8.73   0.000     .2328094    .3675158
              2003  |   .2446623     .03501     6.99   0.000     .1760434    .3132812
              2004  |   .3121699   .0355749     8.77   0.000     .2424437     .381896
              2005  |   .2785758    .036811     7.57   0.000      .206427    .3507245
              2006  |   .2563883   .0374087     6.85   0.000      .183068    .3297086
              2007  |   .1874286    .038799     4.83   0.000     .1113833    .2634739
              2008  |   .1951655   .0402612     4.85   0.000     .1162543    .2740767
              2009  |   .1285905   .0397564     3.23   0.001     .0506687    .2065124
              2010  |   .1852627   .0408714     4.53   0.000     .1051556    .2653698
              2011  |   .1244373   .0420664     2.96   0.003      .041988    .2068866
              2012  |   .3065923   .0424785     7.22   0.000     .2233352    .3898494
              2013  |   .1507582   .0430948     3.50   0.000     .0662931    .2352232
              2014  |   .1811342   .0435952     4.15   0.000     .0956885    .2665798
              2015  |   .2143141   .0428326     5.00   0.000      .130363    .2982651
              2016  |    .171858   .0429534     4.00   0.000     .0876702    .2560458
                    |
              _cons |   3.156898   .4046067     7.80   0.000     2.363877    3.949919
--------------------+----------------------------------------------------------------
            sigma_u |  7.1953494
            sigma_e |  1.8750987
                rho |  .93640702   (fraction of variance due to u_i)
-------------------------------------------------------------------------------------
F test that all u_i=0: F(6911, 148184) = 305.11              Prob > F = 0.0000

. outreg2 using table_voting, tex append ctitle(3) paren se bdec(3)
table_voting.tex
dir : seeout

. 
end of do-file

. do "/var/folders/w3/gyjcgdsx15vc8y_zdl2rd2bh0000gn/T//SD01139.000000"

. 
. * perm_member does not vary over time so cannot include it
. 
. * Agenda_proportion = Speech_proportion + temp_member_dummy + log_gdp w/ year and cou
> ntry-topic fixed effects
. xtreg agenda_pct speech_pct temp_member log_gdp i.year, fe

Fixed-effects (within) regression               Number of obs     =    155,124
Group variable: country_to~c                    Number of groups  =      6,912

R-sq:                                           Obs per group:
     within  = 0.0139                                         min =          4
     between = 0.0540                                         avg =       22.4
     overall = 0.0383                                         max =         24

                                                F(26,148186)      =      80.27
corr(u_i, Xb)  = -0.2720                        Prob > F          =     0.0000

------------------------------------------------------------------------------
  agenda_pct |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
  speech_pct |  -.0846668   .0020193   -41.93   0.000    -.0886245    -.080709
 temp_member |   .0006639   .0220515     0.03   0.976    -.0425566    .0438843
     log_gdp |   .0013519   .0177285     0.08   0.939    -.0333956    .0360995
             |
        year |
       1994  |    .478831   .0343842    13.93   0.000     .4114388    .5462233
       1995  |   .1467738   .0344989     4.25   0.000     .0791567    .2143909
       1996  |   .1806379   .0341821     5.28   0.000     .1136417    .2476341
       1997  |   .2111922   .0345414     6.11   0.000     .1434917    .2788926
       1998  |   .2654044   .0343826     7.72   0.000     .1980151    .3327937
       1999  |   .2836498   .0342573     8.28   0.000     .2165062    .3507934
       2000  |   .2192321    .034564     6.34   0.000     .1514873    .2869769
       2001  |    .262531   .0341958     7.68   0.000      .195508     .329554
       2002  |   .3001951   .0343642     8.74   0.000     .2328419    .3675483
       2003  |   .2446635   .0350101     6.99   0.000     .1760443    .3132826
       2004  |   .3121725   .0355725     8.78   0.000     .2424511    .3818939
       2005  |   .2785994   .0368091     7.57   0.000     .2064542    .3507445
       2006  |   .2564307   .0374085     6.85   0.000     .1831108    .3297506
       2007  |   .1874337   .0387987     4.83   0.000      .111389    .2634785
       2008  |   .1951722    .040261     4.85   0.000     .1162613     .274083
       2009  |   .1286129   .0397553     3.24   0.001     .0506933    .2065325
       2010  |    .185308   .0408681     4.53   0.000     .1052074    .2654086
       2011  |   .1244564   .0420612     2.96   0.003     .0420172    .2068956
       2012  |   .3066083   .0424768     7.22   0.000     .2233547    .3898619
       2013  |    .150807   .0430952     3.50   0.000     .0663413    .2352726
       2014  |   .1811578   .0435955     4.16   0.000     .0957114    .2666041
       2015  |   .2143123   .0428326     5.00   0.000     .1303612    .2982634
       2016  |   .1719137   .0429517     4.00   0.000     .0877293    .2560981
             |
       _cons |   3.158224   .4045519     7.81   0.000      2.36531    3.951137
-------------+----------------------------------------------------------------
     sigma_u |  7.1953546
     sigma_e |  1.8751147
         rho |  .93640609   (fraction of variance due to u_i)
------------------------------------------------------------------------------
F test that all u_i=0: F(6911, 148186) = 305.10              Prob > F = 0.0000

. outreg2 using table_voting, tex replace title(Table 1: All resolutions) ctitle(1) par
> en se bdec(3) nocons
table_voting.tex
dir : seeout

. 
. * Add interactions for Speech_proportion * temp_member
. xtreg agenda_pct speech_pct temp_member log_gdp c.speech_pct#temp_member i.year, fe

Fixed-effects (within) regression               Number of obs     =    155,124
Group variable: country_to~c                    Number of groups  =      6,912

R-sq:                                           Obs per group:
     within  = 0.0139                                         min =          4
     between = 0.0540                                         avg =       22.4
     overall = 0.0383                                         max =         24

                                                F(27,148185)      =      77.47
corr(u_i, Xb)  = -0.2720                        Prob > F          =     0.0000

------------------------------------------------------------------------------
  agenda_pct |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
  speech_pct |  -.0842469   .0020289   -41.52   0.000    -.0882236   -.0802703
 temp_member |   .0209331   .0240239     0.87   0.384    -.0261533    .0680194
     log_gdp |   .0013574   .0177283     0.08   0.939    -.0333898    .0361045
             |
 temp_member#|
c.speech_pct |
          1  |  -.0077952   .0036665    -2.13   0.033    -.0149815   -.0006089
             |
        year |
       1994  |   .4788109   .0343837    13.93   0.000     .4114194    .5462024
       1995  |   .1467513   .0344985     4.25   0.000     .0791351    .2143676
       1996  |   .1806117   .0341817     5.28   0.000     .1136163    .2476071
       1997  |   .2111449    .034541     6.11   0.000     .1434452    .2788446
       1998  |   .2653404   .0343822     7.72   0.000     .1979519    .3327289
       1999  |   .2835963   .0342569     8.28   0.000     .2164535    .3507391
       2000  |   .2192092   .0345636     6.34   0.000     .1514652    .2869532
       2001  |   .2624828   .0341954     7.68   0.000     .1954605     .329505
       2002  |   .3001657   .0343638     8.73   0.000     .2328133    .3675181
       2003  |   .2446599   .0350097     6.99   0.000     .1760416    .3132782
       2004  |   .3121604   .0355721     8.78   0.000     .2424399     .381881
       2005  |   .2785672   .0368087     7.57   0.000     .2064229    .3507115
       2006  |   .2563842   .0374081     6.85   0.000     .1830652    .3297033
       2007  |    .187424   .0387983     4.83   0.000     .1113802    .2634678
       2008  |    .195161   .0402606     4.85   0.000     .1162511    .2740709
       2009  |   .1285832   .0397548     3.23   0.001     .0506645    .2065019
       2010  |   .1852511   .0408676     4.53   0.000     .1051514    .2653508
       2011  |   .1244227   .0420607     2.96   0.003     .0419845    .2068609
       2012  |   .3065831   .0424763     7.22   0.000     .2233305    .3898358
       2013  |   .1507568   .0430946     3.50   0.000     .0662921    .2352214
       2014  |   .1811336    .043595     4.15   0.000     .0956882     .266579
       2015  |   .2143104   .0428321     5.00   0.000     .1303603    .2982605
       2016  |   .1718489   .0429512     4.00   0.000     .0876655    .2560323
             |
       _cons |   3.157045   .4045475     7.80   0.000      2.36414     3.94995
-------------+----------------------------------------------------------------
     sigma_u |  7.1953494
     sigma_e |  1.8750924
         rho |  .93640742   (fraction of variance due to u_i)
------------------------------------------------------------------------------
F test that all u_i=0: F(6911, 148185) = 305.11              Prob > F = 0.0000

. outreg2 using table_voting, tex append ctitle(2) paren se bdec(3)
table_voting.tex
dir : seeout

. 
. * Add another interaction for GDP * temp_member
. xtreg agenda_pct speech_pct temp_member log_gdp c.speech_pct#temp_member c.log_gdp#te
> mp_member i.year, fe

Fixed-effects (within) regression               Number of obs     =    155,124
Group variable: country_to~c                    Number of groups  =      6,912

R-sq:                                           Obs per group:
     within  = 0.0139                                         min =          4
     between = 0.0540                                         avg =       22.4
     overall = 0.0383                                         max =         24

                                                F(28,148184)      =      74.70
corr(u_i, Xb)  = -0.2720                        Prob > F          =     0.0000

------------------------------------------------------------------------------
  agenda_pct |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
  speech_pct |   -.084247   .0020289   -41.52   0.000    -.0882236   -.0802704
 temp_member |   .0266023   .2658394     0.10   0.920    -.4944377    .5476422
     log_gdp |   .0013635   .0177307     0.08   0.939    -.0333883    .0361153
             |
 temp_member#|
c.speech_pct |
          1  |   -.007795   .0036665    -2.13   0.034    -.0149813   -.0006087
             |
 temp_member#|
   c.log_gdp |
          1  |  -.0002263   .0105664    -0.02   0.983    -.0209362    .0204837
             |
        year |
       1994  |   .4788056   .0343847    13.92   0.000     .4114122     .546199
       1995  |   .1467518   .0344986     4.25   0.000     .0791353    .2143684
       1996  |    .180616   .0341824     5.28   0.000     .1136192    .2476128
       1997  |   .2111495   .0345418     6.11   0.000     .1434482    .2788507
       1998  |   .2653378   .0343826     7.72   0.000     .1979487     .332727
       1999  |   .2835935   .0342573     8.28   0.000       .21645     .350737
       2000  |   .2192073   .0345639     6.34   0.000     .1514628    .2869517
       2001  |   .2624774   .0341964     7.68   0.000     .1954531    .3295016
       2002  |   .3001626   .0343642     8.73   0.000     .2328094    .3675158
       2003  |   .2446623     .03501     6.99   0.000     .1760434    .3132812
       2004  |   .3121699   .0355749     8.77   0.000     .2424437     .381896
       2005  |   .2785758    .036811     7.57   0.000      .206427    .3507245
       2006  |   .2563883   .0374087     6.85   0.000      .183068    .3297086
       2007  |   .1874286    .038799     4.83   0.000     .1113833    .2634739
       2008  |   .1951655   .0402612     4.85   0.000     .1162543    .2740767
       2009  |   .1285905   .0397564     3.23   0.001     .0506687    .2065124
       2010  |   .1852627   .0408714     4.53   0.000     .1051556    .2653698
       2011  |   .1244373   .0420664     2.96   0.003      .041988    .2068866
       2012  |   .3065923   .0424785     7.22   0.000     .2233352    .3898494
       2013  |   .1507582   .0430948     3.50   0.000     .0662931    .2352232
       2014  |   .1811342   .0435952     4.15   0.000     .0956885    .2665798
       2015  |   .2143141   .0428326     5.00   0.000      .130363    .2982651
       2016  |    .171858   .0429534     4.00   0.000     .0876702    .2560458
             |
       _cons |   3.156898   .4046067     7.80   0.000     2.363877    3.949919
-------------+----------------------------------------------------------------
     sigma_u |  7.1953494
     sigma_e |  1.8750987
         rho |  .93640702   (fraction of variance due to u_i)
------------------------------------------------------------------------------
F test that all u_i=0: F(6911, 148184) = 305.11              Prob > F = 0.0000

. outreg2 using table_voting, tex append ctitle(3) paren se bdec(3)
table_voting.tex
dir : seeout

. 
end of do-file

