-------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /Users/lesliehuang/un-analysis-reg/un_log_voting.log
  log type:  text
 opened on:  27 Nov 2017, 22:11:31

. 
. set seed 1234

. 
. * import data
. import delimited data_by_country_year_topic_consensus_only
(12 vars, 168948 obs)

. 
. encode country, gen(country1)

. encode topic, gen(topic1)

. 
. gen log_gdp = log(gdp)
(5,206 missing values generated)

. 
. encode sc_membership, gen(sc_membership1)

. 
. egen country_topic = group(country1 topic1)

. 
. * Set the panel vars and inspect
. 
. xtset country_topic year
       panel variable:  country_topic (unbalanced)
        time variable:  year, 1993 to 2016, but with gaps
                delta:  1 unit

. 
. xtsum

Variable         |      Mean   Std. Dev.       Min        Max |    Observations
-----------------+--------------------------------------------+----------------
country  overall |         .          .          .          . |     N =       0
         between |                    .          .          . |     n =       0
         within  |                    .          .          . |     T =       .
                 |                                            |
gdp      overall |  2.70e+11   1.17e+12   1.32e+07   1.86e+13 |     N =  163742
         between |             1.06e+12   2.73e+07   1.25e+13 |     n =    7296
         within  |             4.11e+11  -5.39e+12   7.46e+12 | T-bar = 22.4427
                 |                                            |
perm_m~r overall |  .0269906   .1620562          0          1 |     N =  168948
         between |             .1588679          0          1 |     n =    7334
         within  |                    0   .0269906   .0269906 | T-bar = 23.0363
                 |                                            |
propor~a overall |  .0310582   .0680555          0    .479452 |     N =  168948
         between |             .0673838          0   .4253409 |     n =    7334
         within  |             .0096663  -.0432297   .1052243 | T-bar = 23.0363
                 |                                            |
record~e overall |         .          .          .          . |     N =       0
         between |                    .          .          . |     n =       0
         within  |                    .          .          . |     T =       .
                 |                                            |
sc_mem~p overall |         .          .          .          . |     N =       0
         between |                    .          .          . |     n =       0
         within  |                    .          .          . |     T =       .
                 |                                            |
sessio~m overall |  59.66329   6.889661         48         71 |     N =  168948
         between |             1.187379   55.78571       68.5 |     n =    7334
         within  |             6.833124   47.09186   72.74022 | T-bar = 23.0363
                 |                                            |
speaker  overall |         .          .          .          . |     N =       0
         between |                    .          .          . |     n =       0
         within  |                    .          .          . |     T =       .
                 |                                            |
speech~n overall |  .0258521   .0617097   .0001692   .7325845 |     N =  160056
         between |             .0571177   .0011271   .6086785 |     n =    6948
         within  |             .0236615  -.2584085   .4035768 | T-bar = 23.0363
                 |                                            |
temp_m~r overall |  .0537562   .2255366          0          1 |     N =  168948
         between |             .0713336          0   .3333333 |     n =    7334
         within  |             .2137665  -.2795771    1.01209 | T-bar = 23.0363
                 |                                            |
topic    overall |         .          .          .          . |     N =       0
         between |                    .          .          . |     n =       0
         within  |                    .          .          . |     T =       .
                 |                                            |
year     overall |  2004.667   6.887028       1993       2016 |     N =  168948
         between |             1.186262   2000.786     2013.5 |     n =    7334
         within  |             6.830619   1992.095   2017.744 | T-bar = 23.0363
                 |                                            |
country1 overall |  95.61381   55.60155          1        193 |     N =  168948
         between |             55.71735          1        193 |     n =    7334
         within  |                    0   95.61381   95.61381 | T-bar = 23.0363
                 |                                            |
topic1   overall |      19.5   10.96589          1         38 |     N =  168948
         between |              10.9666          1         38 |     n =    7334
         within  |                    0       19.5       19.5 | T-bar = 23.0363
                 |                                            |
log_gdp  overall |  23.57697   2.441092   16.39547   30.55418 |     N =  163742
         between |             2.395146   17.06457   30.11726 |     n =    7296
         within  |             .5976466   20.28548   25.66845 | T-bar = 22.4427
                 |                                            |
sc_mem~1 overall |   2.12933   .4800663          1          4 |     N =  168948
         between |             .2160599          1          3 |     n =    7334
         within  |             .4275331   1.462663   4.045996 | T-bar = 23.0363
                 |                                            |
countr~c overall |  3614.825   2112.887          1       7334 |     N =  168948
         between |             2117.288          1       7334 |     n =    7334
         within  |                    0   3614.825   3614.825 | T-bar = 23.0363

. 
. * FYI perm_member does not vary over time so cannot include it
. 
. * Plain ol OLS
. 
. * Agenda_proportion = Speech_proportion + temp_member_dummy + log_gdp w/ year and country
> -topic fixed effects
. xtreg proportion_of_agenda speech_proportion temp_member log_gdp i.year, fe

Fixed-effects (within) regression               Number of obs     =    155,124
Group variable: country_to~c                    Number of groups  =      6,912

R-sq:                                           Obs per group:
     within  = 0.0181                                         min =          4
     between = 0.5786                                         avg =       22.4
     overall = 0.1229                                         max =         24

                                                F(26,148186)      =     104.87
corr(u_i, Xb)  = -0.3711                        Prob > F          =     0.0000

-----------------------------------------------------------------------------------
proportion_of_a~a |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
------------------+----------------------------------------------------------------
speech_proportion |  -.0111864   .0010014   -11.17   0.000    -.0131492   -.0092237
      temp_member |   2.90e-06   .0001094     0.03   0.979    -.0002114    .0002172
          log_gdp |   5.95e-06   .0000879     0.07   0.946    -.0001664    .0001783
                  |
             year |
            1994  |  -.0002991   .0001705    -1.75   0.079    -.0006333    .0000351
            1995  |   .0006519   .0001711     3.81   0.000     .0003166    .0009873
            1996  |   .0008829   .0001695     5.21   0.000     .0005507    .0012152
            1997  |  -.0016371   .0001713    -9.56   0.000    -.0019729   -.0013014
            1998  |  -.0014709   .0001705    -8.63   0.000    -.0018051   -.0011367
            1999  |   .0002138   .0001699     1.26   0.208    -.0001191    .0005468
            2000  |    .000431   .0001714     2.51   0.012      .000095     .000767
            2001  |   .0004648   .0001696     2.74   0.006     .0001324    .0007972
            2002  |  -.0003572   .0001704    -2.10   0.036    -.0006912   -.0000232
            2003  |   .0011772   .0001736     6.78   0.000     .0008369    .0015175
            2004  |   .0012908   .0001764     7.32   0.000     .0009451    .0016366
            2005  |   .0019606   .0001825    10.74   0.000     .0016028    .0023183
            2006  |   .0010731   .0001855     5.78   0.000     .0007095    .0014367
            2007  |   .0025318   .0001924    13.16   0.000     .0021547    .0029089
            2008  |   .0025657   .0001997    12.85   0.000     .0021744    .0029571
            2009  |   .0014544   .0001972     7.38   0.000      .001068    .0018408
            2010  |   .0016206   .0002027     8.00   0.000     .0012234    .0020179
            2011  |    .002452   .0002086    11.75   0.000     .0020431    .0028608
            2012  |   .0018083   .0002107     8.58   0.000     .0013954    .0022212
            2013  |    .002649   .0002137    12.40   0.000     .0022302    .0030679
            2014  |   .0024966   .0002162    11.55   0.000     .0020729    .0029204
            2015  |   .0025565   .0002124    12.04   0.000     .0021402    .0029729
            2016  |   .0016755    .000213     7.87   0.000      .001258     .002093
                  |
            _cons |   .0307818   .0020062    15.34   0.000     .0268496     .034714
------------------+----------------------------------------------------------------
          sigma_u |  .06953703
          sigma_e |  .00929904
              rho |  .98243105   (fraction of variance due to u_i)
-----------------------------------------------------------------------------------
F test that all u_i=0: F(6911, 148186) = 539.54              Prob > F = 0.0000

. outreg2 using table_consensus, tex replace title(Table 1: Consensus resolutions) ctitle(1
> ) paren se bdec(3) nocons
table_consensus.tex
dir : seeout

. 
. * Add interactions for Speech_proportion * temp_member
. xtreg proportion_of_agenda speech_proportion temp_member log_gdp c.speech_proportion#temp
> _member i.year, fe

Fixed-effects (within) regression               Number of obs     =    155,124
Group variable: country_to~c                    Number of groups  =      6,912

R-sq:                                           Obs per group:
     within  = 0.0181                                         min =          4
     between = 0.5785                                         avg =       22.4
     overall = 0.1229                                         max =         24

                                                F(27,148185)      =     100.99
corr(u_i, Xb)  = -0.3711                        Prob > F          =     0.0000

-------------------------------------------------------------------------------------
proportion_of_age~a |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
--------------------+----------------------------------------------------------------
  speech_proportion |  -.0112008   .0010062   -11.13   0.000    -.0131729   -.0092287
        temp_member |  -4.05e-06   .0001191    -0.03   0.973    -.0002376    .0002295
            log_gdp |   5.95e-06   .0000879     0.07   0.946    -.0001664    .0001783
                    |
        temp_member#|
c.speech_proportion |
                 1  |   .0002674   .0018183     0.15   0.883    -.0032964    .0038313
                    |
               year |
              1994  |  -.0002991   .0001705    -1.75   0.079    -.0006333    .0000351
              1995  |   .0006519   .0001711     3.81   0.000     .0003166    .0009873
              1996  |   .0008829   .0001695     5.21   0.000     .0005507    .0012152
              1997  |  -.0016371   .0001713    -9.56   0.000    -.0019729   -.0013014
              1998  |  -.0014709   .0001705    -8.63   0.000    -.0018051   -.0011367
              1999  |   .0002139   .0001699     1.26   0.208    -.0001191    .0005468
              2000  |    .000431   .0001714     2.51   0.012      .000095     .000767
              2001  |   .0004648   .0001696     2.74   0.006     .0001324    .0007972
              2002  |  -.0003572   .0001704    -2.10   0.036    -.0006912   -.0000232
              2003  |   .0011772   .0001736     6.78   0.000     .0008369    .0015175
              2004  |   .0012908   .0001764     7.32   0.000     .0009451    .0016366
              2005  |   .0019606   .0001825    10.74   0.000     .0016028    .0023184
              2006  |   .0010731   .0001855     5.78   0.000     .0007095    .0014367
              2007  |   .0025318   .0001924    13.16   0.000     .0021547    .0029089
              2008  |   .0025657   .0001997    12.85   0.000     .0021744    .0029571
              2009  |   .0014544   .0001972     7.38   0.000      .001068    .0018408
              2010  |   .0016207   .0002027     8.00   0.000     .0012234    .0020179
              2011  |    .002452   .0002086    11.75   0.000     .0020431    .0028608
              2012  |   .0018083   .0002107     8.58   0.000     .0013954    .0022212
              2013  |    .002649   .0002137    12.40   0.000     .0022302    .0030679
              2014  |   .0024966   .0002162    11.55   0.000     .0020729    .0029204
              2015  |   .0025565   .0002124    12.04   0.000     .0021402    .0029729
              2016  |   .0016755    .000213     7.87   0.000      .001258     .002093
                    |
              _cons |   .0307822   .0020063    15.34   0.000       .02685    .0347144
--------------------+----------------------------------------------------------------
            sigma_u |  .06953705
            sigma_e |  .00929907
                rho |  .98243094   (fraction of variance due to u_i)
-------------------------------------------------------------------------------------
F test that all u_i=0: F(6911, 148185) = 539.43              Prob > F = 0.0000

. outreg2 using table_consensus, tex append ctitle(2) paren se bdec(3)
table_consensus.tex
dir : seeout

. 
. * Add another interaction for GDP * temp_member
. xtreg proportion_of_agenda speech_proportion temp_member log_gdp c.speech_proportion#temp
> _member c.log_gdp#temp_member i.year, fe

Fixed-effects (within) regression               Number of obs     =    155,124
Group variable: country_to~c                    Number of groups  =      6,912

R-sq:                                           Obs per group:
     within  = 0.0181                                         min =          4
     between = 0.5785                                         avg =       22.4
     overall = 0.1229                                         max =         24

                                                F(28,148184)      =      97.38
corr(u_i, Xb)  = -0.3711                        Prob > F          =     0.0000

---------------------------------------------------------------------------------------
 proportion_of_agenda |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
----------------------+----------------------------------------------------------------
    speech_proportion |  -.0112008   .0010062   -11.13   0.000     -.013173   -.0092287
          temp_member |  -2.63e-06   .0013184    -0.00   0.998    -.0025866    .0025813
              log_gdp |   5.95e-06   .0000879     0.07   0.946    -.0001664    .0001783
                      |
          temp_member#|
  c.speech_proportion |
                   1  |   .0002674   .0018183     0.15   0.883    -.0032965    .0038313
                      |
temp_member#c.log_gdp |
                   1  |  -5.68e-08   .0000524    -0.00   0.999    -.0001028    .0001026
                      |
                 year |
                1994  |  -.0002991   .0001705    -1.75   0.079    -.0006333    .0000351
                1995  |   .0006519   .0001711     3.81   0.000     .0003166    .0009873
                1996  |    .000883   .0001695     5.21   0.000     .0005507    .0012152
                1997  |  -.0016371   .0001713    -9.56   0.000    -.0019729   -.0013014
                1998  |  -.0014709   .0001705    -8.63   0.000    -.0018051   -.0011367
                1999  |   .0002139   .0001699     1.26   0.208    -.0001191    .0005468
                2000  |    .000431   .0001714     2.51   0.012      .000095     .000767
                2001  |   .0004648   .0001696     2.74   0.006     .0001324    .0007972
                2002  |  -.0003572   .0001704    -2.10   0.036    -.0006912   -.0000232
                2003  |   .0011772   .0001736     6.78   0.000     .0008369    .0015175
                2004  |   .0012908   .0001764     7.32   0.000      .000945    .0016366
                2005  |   .0019606   .0001826    10.74   0.000     .0016028    .0023184
                2006  |   .0010731   .0001855     5.78   0.000     .0007095    .0014367
                2007  |   .0025318   .0001924    13.16   0.000     .0021547    .0029089
                2008  |   .0025657   .0001997    12.85   0.000     .0021744    .0029571
                2009  |   .0014544   .0001972     7.38   0.000      .001068    .0018408
                2010  |   .0016207   .0002027     8.00   0.000     .0012234    .0020179
                2011  |    .002452   .0002086    11.75   0.000     .0020431    .0028609
                2012  |   .0018083   .0002107     8.58   0.000     .0013954    .0022212
                2013  |   .0026491   .0002137    12.40   0.000     .0022302    .0030679
                2014  |   .0024966   .0002162    11.55   0.000     .0020729    .0029204
                2015  |   .0025565   .0002124    12.04   0.000     .0021402    .0029729
                2016  |   .0016755    .000213     7.87   0.000      .001258     .002093
                      |
                _cons |   .0307822   .0020065    15.34   0.000     .0268494     .034715
----------------------+----------------------------------------------------------------
              sigma_u |  .06953705
              sigma_e |   .0092991
                  rho |  .98243082   (fraction of variance due to u_i)
---------------------------------------------------------------------------------------
F test that all u_i=0: F(6911, 148184) = 539.42              Prob > F = 0.0000

. outreg2 using table_consensus, tex append ctitle(3) paren se bdec(3)
table_consensus.tex
dir : seeout

. 
. 
. * Add another interaction for GDP * speech_proportion
. xtreg proportion_of_agenda speech_proportion temp_member log_gdp c.speech_proportion#temp
> _member c.log_gdp#temp_member c.log_gdp#c.speech_proportion i.year, fe

Fixed-effects (within) regression               Number of obs     =    155,124
Group variable: country_to~c                    Number of groups  =      6,912

R-sq:                                           Obs per group:
     within  = 0.0182                                         min =          4
     between = 0.5374                                         avg =       22.4
     overall = 0.1126                                         max =         24

                                                F(29,148183)      =      94.57
corr(u_i, Xb)  = -0.3562                        Prob > F          =     0.0000

---------------------------------------------------------------------------------------
 proportion_of_agenda |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
----------------------+----------------------------------------------------------------
    speech_proportion |   .0228015   .0086638     2.63   0.008     .0058206    .0397824
          temp_member |  -.0000145   .0013183    -0.01   0.991    -.0025984    .0025693
              log_gdp |    .000043   .0000884     0.49   0.626    -.0001303    .0002163
                      |
          temp_member#|
  c.speech_proportion |
                   1  |    .000753   .0018224     0.41   0.679    -.0028188    .0043249
                      |
temp_member#c.log_gdp |
                   1  |  -8.23e-08   .0000524    -0.00   0.999    -.0001028    .0001026
                      |
            c.log_gdp#|
  c.speech_proportion |  -.0014206   .0003595    -3.95   0.000    -.0021253    -.000716
                      |
                 year |
                1994  |  -.0002993   .0001705    -1.76   0.079    -.0006335    .0000349
                1995  |    .000652   .0001711     3.81   0.000     .0003167    .0009873
                1996  |   .0008833   .0001695     5.21   0.000      .000551    .0012155
                1997  |  -.0016369   .0001713    -9.56   0.000    -.0019726   -.0013012
                1998  |   -.001471   .0001705    -8.63   0.000    -.0018052   -.0011368
                1999  |   .0002145   .0001699     1.26   0.207    -.0001185    .0005474
                2000  |    .000432   .0001714     2.52   0.012     .0000961     .000768
                2001  |   .0004655   .0001696     2.75   0.006     .0001331    .0007979
                2002  |  -.0003563   .0001704    -2.09   0.037    -.0006903   -.0000223
                2003  |   .0011779   .0001736     6.78   0.000     .0008376    .0015182
                2004  |   .0012913   .0001764     7.32   0.000     .0009456    .0016371
                2005  |   .0019615   .0001825    10.75   0.000     .0016037    .0023193
                2006  |   .0010739   .0001855     5.79   0.000     .0007103    .0014374
                2007  |   .0025314   .0001924    13.16   0.000     .0021543    .0029086
                2008  |   .0025655   .0001997    12.85   0.000     .0021742    .0029569
                2009  |   .0014541   .0001972     7.38   0.000     .0010677    .0018405
                2010  |   .0016206   .0002027     8.00   0.000     .0012233    .0020178
                2011  |   .0024513   .0002086    11.75   0.000     .0020424    .0028602
                2012  |   .0018076   .0002107     8.58   0.000     .0013948    .0022205
                2013  |   .0026489   .0002137    12.40   0.000     .0022301    .0030678
                2014  |   .0024962   .0002162    11.55   0.000     .0020725      .00292
                2015  |   .0025563   .0002124    12.03   0.000       .00214    .0029726
                2016  |   .0016749    .000213     7.86   0.000     .0012575    .0020924
                      |
                _cons |   .0298943    .002019    14.81   0.000     .0259371    .0338515
----------------------+----------------------------------------------------------------
              sigma_u |  .06951008
              sigma_e |  .00929864
                  rho |  .98241913   (fraction of variance due to u_i)
---------------------------------------------------------------------------------------
F test that all u_i=0: F(6911, 148183) = 539.33              Prob > F = 0.0000

. outreg2 using table_consensus, tex append ctitle(4) paren se bdec(3)
table_consensus.tex
dir : seeout

. 
end of do-file

. do "/var/folders/w3/gyjcgdsx15vc8y_zdl2rd2bh0000gn/T//SD08249.000000"

. 
. * Agenda_proportion = Speech_proportion + temp_member_dummy + log_gdp w/ year and country
> -topic fixed effects
. xtreg proportion_of_agenda speech_proportion temp_member log_gdp, fe

Fixed-effects (within) regression               Number of obs     =    155,124
Group variable: country_to~c                    Number of groups  =      6,912

R-sq:                                           Obs per group:
     within  = 0.0103                                         min =          4
     between = 0.0209                                         avg =       22.4
     overall = 0.0186                                         max =         24

                                                F(3,148209)       =     515.25
corr(u_i, Xb)  = -0.1897                        Prob > F          =     0.0000

-----------------------------------------------------------------------------------
proportion_of_a~a |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
------------------+----------------------------------------------------------------
speech_proportion |  -.0112974   .0010052   -11.24   0.000    -.0132676   -.0093272
      temp_member |  -.0000777   .0001097    -0.71   0.479    -.0002927    .0001373
          log_gdp |   .0014926   .0000397    37.63   0.000     .0014149    .0015704
            _cons |  -.0031444   .0009359    -3.36   0.001    -.0049787   -.0013101
------------------+----------------------------------------------------------------
          sigma_u |  .06963669
          sigma_e |  .00933492
              rho |  .98234733   (fraction of variance due to u_i)
-----------------------------------------------------------------------------------
F test that all u_i=0: F(6911, 148209) = 535.66              Prob > F = 0.0000

. outreg2 using table_consensus, tex replace title(Table 1: Consensus resolutions) ctitle(1
> ) paren se bdec(3) nocons
table_consensus.tex
dir : seeout

. 
. * Add interactions for Speech_proportion * temp_member
. xtreg proportion_of_agenda speech_proportion temp_member log_gdp c.speech_proportion#temp
> _member, fe

Fixed-effects (within) regression               Number of obs     =    155,124
Group variable: country_to~c                    Number of groups  =      6,912

R-sq:                                           Obs per group:
     within  = 0.0103                                         min =          4
     between = 0.0209                                         avg =       22.4
     overall = 0.0186                                         max =         24

                                                F(4,148208)       =     386.44
corr(u_i, Xb)  = -0.1897                        Prob > F          =     0.0000

-------------------------------------------------------------------------------------
proportion_of_age~a |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
--------------------+----------------------------------------------------------------
  speech_proportion |  -.0113148     .00101   -11.20   0.000    -.0132945   -.0093352
        temp_member |  -.0000861   .0001195    -0.72   0.471    -.0003203    .0001481
            log_gdp |   .0014926   .0000397    37.63   0.000     .0014149    .0015704
                    |
        temp_member#|
c.speech_proportion |
                 1  |   .0003235   .0018253     0.18   0.859    -.0032541    .0039011
                    |
              _cons |  -.0031439   .0009359    -3.36   0.001    -.0049782   -.0013096
--------------------+----------------------------------------------------------------
            sigma_u |  .06963671
            sigma_e |  .00933495
                rho |  .98234723   (fraction of variance due to u_i)
-------------------------------------------------------------------------------------
F test that all u_i=0: F(6911, 148208) = 535.55              Prob > F = 0.0000

. outreg2 using table_consensus, tex append ctitle(2) paren se bdec(3)
table_consensus.tex
dir : seeout

. 
. * Add another interaction for GDP * temp_member
. xtreg proportion_of_agenda speech_proportion temp_member log_gdp c.speech_proportion#temp
> _member c.log_gdp#temp_member, fe

Fixed-effects (within) regression               Number of obs     =    155,124
Group variable: country_to~c                    Number of groups  =      6,912

R-sq:                                           Obs per group:
     within  = 0.0103                                         min =          4
     between = 0.0209                                         avg =       22.4
     overall = 0.0186                                         max =         24

                                                F(5,148207)       =     309.17
corr(u_i, Xb)  = -0.1897                        Prob > F          =     0.0000

---------------------------------------------------------------------------------------
 proportion_of_agenda |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
----------------------+----------------------------------------------------------------
    speech_proportion |  -.0113145     .00101   -11.20   0.000    -.0132942   -.0093349
          temp_member |  -.0004988   .0013222    -0.38   0.706    -.0030903    .0020926
              log_gdp |   .0014918   .0000397    37.53   0.000     .0014139    .0015697
                      |
          temp_member#|
  c.speech_proportion |
                   1  |    .000322   .0018253     0.18   0.860    -.0032556    .0038996
                      |
temp_member#c.log_gdp |
                   1  |   .0000165   .0000526     0.31   0.754    -.0000865    .0001195
                      |
                _cons |   -.003125   .0009378    -3.33   0.001    -.0049631    -.001287
----------------------+----------------------------------------------------------------
              sigma_u |  .06963668
              sigma_e |  .00933498
                  rho |  .98234711   (fraction of variance due to u_i)
---------------------------------------------------------------------------------------
F test that all u_i=0: F(6911, 148207) = 535.54              Prob > F = 0.0000

. outreg2 using table_consensus, tex append ctitle(3) paren se bdec(3)
table_consensus.tex
dir : seeout

. 
. 
. * Add another interaction for GDP * speech_proportion
. xtreg proportion_of_agenda speech_proportion temp_member log_gdp c.speech_proportion#temp
> _member c.log_gdp#temp_member c.log_gdp#c.speech_proportion, fe

Fixed-effects (within) regression               Number of obs     =    155,124
Group variable: country_to~c                    Number of groups  =      6,912

R-sq:                                           Obs per group:
     within  = 0.0104                                         min =          4
     between = 0.0188                                         avg =       22.4
     overall = 0.0172                                         max =         24

                                                F(6,148206)       =     260.25
corr(u_i, Xb)  = -0.1842                        Prob > F          =     0.0000

---------------------------------------------------------------------------------------
 proportion_of_agenda |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
----------------------+----------------------------------------------------------------
    speech_proportion |   .0227027   .0086971     2.61   0.009     .0056565    .0397489
          temp_member |  -.0005105   .0013221    -0.39   0.699    -.0031018    .0020808
              log_gdp |   .0015285   .0000408    37.44   0.000     .0014485    .0016085
                      |
          temp_member#|
  c.speech_proportion |
                   1  |   .0008078   .0018294     0.44   0.659    -.0027778    .0043935
                      |
temp_member#c.log_gdp |
                   1  |   .0000164   .0000526     0.31   0.754    -.0000866    .0001194
                      |
            c.log_gdp#|
  c.speech_proportion |  -.0014213   .0003609    -3.94   0.000    -.0021287   -.0007139
                      |
                _cons |  -.0040026   .0009639    -4.15   0.000    -.0058918   -.0021134
----------------------+----------------------------------------------------------------
              sigma_u |  .06960968
              sigma_e |  .00933452
                  rho |  .98233535   (fraction of variance due to u_i)
---------------------------------------------------------------------------------------
F test that all u_i=0: F(6911, 148206) = 535.45              Prob > F = 0.0000

. outreg2 using table_consensus, tex append ctitle(4) paren se bdec(3)
table_consensus.tex
dir : seeout

. 
end of do-file

. exit, clear
